{
  "quests": [
    {
      "name": "My thoughts...",
      "unlocked": true,
      "entries": [
        {
          "unlocked": true,
          "text": "I have finally arrived to Luarca, I should go around and try to talk with the people here!",
          "image": ""
        },
        {
          "unlocked": false,
          "text": "Not all the villagers were friendly, but apparently there is a \"dragon\" attack going on? What is actually going on here?",
          "image": ""
        }
      ]
    },
    {
      "name": "The San Juan Festival & Luarca",
      "unlocked": false,
      "entries": [
        {
          "unlocked": false,
          "text": "Luarca is a village at northwestern Austrias province, first discovered by Asturian archeologist José Manuel Gonzáles. Once busy fishing village now looks almost abandoned.",
          "image": ""
        },
        {
          "unlocked": false,
          "text": "The villagers are nervous and the atmosphere of the town feel tense like there actually is a curse looming over the village. Theres decorations around the town suggesting there might have been a festival, but the locals aren’t willing to tell me much. However the big claw marks and burnt streets allows me to conclude something big attacked the village, but what and why remains unclear.",
          "image": ""
        }
      ]
    },
    {
      "name": "The San Juan Festival & Luarca 2",
      "unlocked": false,
      "entries": [
        {
          "unlocked": false,
          "text": "From what the farmer said the night of San Juan is a Christian celebration with pagan origins. From what was told traditions include lighting bonfires and picking herbs to protect against evil spirits during sun solstice, all rooted in superstition beliefs. But since Asturias was christianized in the 6th century the night of San Juan has become associated with the celebration of Saint John the Baptist’s birth.",
          "image": ""
        }
      ]
    },
    {
      "name": "The Lady of the Lake",
      "unlocked": false,
      "entries": [
        {
          "unlocked": false,
          "text": "The farmer told me about a lady in Xibu lake whos song will grant the villagers protection if I give her some herbs. Guess I have to be on the lookout around the lake.",
          "image": ""
        },
        {
          "unlocked": false,
          "text": "Nearing the Xibu Lake I heard a beautiful voice singing. The voice belonged to a beautiful water fairy who’s name is La Xana. Her songs can be heard during spring and summer nights, filling those with a pure soul with a sense of peace and love. Unfortunately her magic has been weakened and asked me to bring her herbs called St. John wort, valued for its healing properties.",
          "image": ""
        },
        {
          "unlocked": false,
          "text": "I gave La Xana the herbs and she handed me this tear shaped artifact. What can I do with this?",
          "image": ""
        }
      ]
    },
    {
      "name": "The Danger of Luarca",
      "unlocked": false,
      "entries": [
        {
          "unlocked": false,
          "text": "A \"dragon\" have been attacking Luarca and disrupting the San Juan festival.",
          "image": ""
        },
        {
          "unlocked": false,
          "text": "When I wandered into the mountain cave I found myself waking Cuélebre himself from his slumber. The dragon is shaped like a giant serpent with wings, thick scales and sleeps on a giant hoard of gold. Cuélebre is only interested in treasure so I managed to convince him I was a thief, offering to steal anything he wanted. He then allowed me to leave with a quest to steal an artifact from Xibu lake, however it will take more than treasure to convince him to leave Asturias.",
          "image": ""
        }
      ]
    },
    {
      "name": "Mischief in Luarca",
      "unlocked": false,
      "entries": [
        {
          "unlocked": false,
          "text": "I met a weird pink little creature who has spread mischief around the place to mess with the villagers. I should do my best to help and learn more about this creature.",
          "image": ""
        },
        {
          "unlocked": false,
          "text": "I met the mischievous little creature hiding in an abandoned house. He calls himself Trasgu and he’s been pranking the villagers. He seems to take great pride in his schemes so I offered an opportunity to trick the monster who’s taken residence in Asturias if he helps me fix all his other mischiefs.",
          "image": ""
        }
      ]
    },
    {
      "name": "The Devil in the Woods",
      "unlocked": false,
      "entries": [
        {
          "unlocked": false,
          "text": "I found a note by the church speaking of a \"Horned Devil\" in the forest. Seems interesting! I should investigate...",
          "image": ""
        },
        {
          "unlocked": false,
          "text": "The horned devil is no devil at all, but the guardian of Póntigon forest. His name is Busgosu and his job is to protect the interests of the forest. Some days he is known as a peaceful creature and other days a boogeyman, unhesitant to harm anyone who disturbs the forest. Now the forest is threatened by a monster hiding a mountain cave and has forbidden me to pass unless I help fix what’s been broken by a creature causing disturbances.",
          "image": ""
        }
      ]
    }
  ]
}